'''
Дано целое положительное число. Вывести символы, изображающие цифры этого
числа (в порядке справа налево).
'''
num = int(input('Введите число: '))
print(str(num), sep = '')