'''
Найдите максимум и минимум значений. 
d = {'a':10, 'b':20, 'c':30}. 
'''
d = {'a':10, 'b':20, 'c':30}
min_value = min(d.values())
max_value = max(d.values())

print('Минимальное значение:', min_value)
print('Максимальное значение:', max_value)